import spacy
from spacy import displacy
import regex as re
from trankit import Pipeline
from elasticsearchapp.query_results import gather_raw_verbs, get_specific_analyzed
import nltk

# nltk.download('punkt') # only run once
nlp = spacy.load('el_core_news_lg', disable=['ner', 'textcat'])


def important_verb_dict_trankit(type):
    # take the important verbs from all articles based on type
    p = Pipeline('greek')
    important_verbs = []

    important_terms = gather_raw_verbs(type=type, threshold=100)
    tagged_doc = p.posdep(important_terms)  # trankit!
    sentences = tagged_doc['sentences']
    important_verbs.append([sent['tokens'][0]['text'] for sent in sentences if sent['tokens'][0]['upos'] == "VERB"])

    return important_verbs


def important_verb_dict_spacy(type):
    # take the important verbs from all articles based on type
    important_verbs = []

    important_terms = gather_raw_verbs(type=type, threshold=100)
    for term in important_terms:
        doc = nlp(term[0])
        for token in doc:
            if token.pos_ == "VERB":
                important_verbs.append(token.text)
        # important_verbs.append([token.text for token in doc if token.pos_ == "VERB"])

    return important_verbs


def dependency_collector(article):
    doc = nlp(article)
    subject = []
    object = []
    verb = []

    for token in doc:
        gender = re.search("Gender=[^|]*", token.tag_)
        print(token.text, '->', token.pos_, '(', gender, ')')
    with open("dependency.html", "w") as file:
        file.write(displacy.render(doc, style='dep', jupyter=False))
    for token in doc:
        # extract verb
        if token.pos_ == 'VERB':
            verb.append(token.text)
        # extract subject
        if token.dep_ == 'nsubj' or token.dep_ == 'iobj':
            subject.append(token.text)
        # extract object
        elif token.dep_ == 'dobj' or token.dep_ == 'obj':
            object.append(token.text)

    return verb, subject, object


# raw_data, raw_type = get_latest_raw_data()  # raw_data[0][0]
verb, subject, object = dependency_collector("Η ομάδα δακτυλοσκόπησης της Διεύθυνσης Εγκληματολογικών Ερευνών της "
                                             "Αστυνομίας και ο διοικητής του Τμήματος Ασφαλείας Ομόνοιας ήταν οι "
                                             "πρωταγωνιστές στη διαδικασία ταυτοποίησης της 38χρονης Κινέζας, "
                                             "η οποία βρέθηκε δολοφονημένη μέσα σε βαλίτσα στα Βίλια. Ο διοικητής του "
                                             "Τμήματος Ασφαλείας της Ομόνοιας ήταν ο άνθρωπος που από την πρώτη "
                                             "στιγμή που βρέθηκε η βαλίτσα στα Βίλια κατάλαβε ότι το θύμα είναι η "
                                             "εξαφανισμένη Κινέζα. Αμέσως ενημέρωσε το Τμήμα Ανθρωποκτονιών της "
                                             "ΕΛ.ΑΣ. για το «ένστικτό» του. Ο αξιωματικός αυτός είχε ασχοληθεί με την "
                                             "εξαφάνιση της 38χρονης  από τις 17 Οκτωβρίου  2020, "
                                             "όταν δύο ομοεθνείς της είχαν δηλώσει την εξαφάνιση στο Τ.Α. Ομόνοιας. "
                                             "Τα χαρακτηριστικά του πτώματος στα Βίλια ταίριαζαν στις περιγραφές που "
                                             "είχαν δοθεί για την 38χρονη  , για την οποία υπήρχαν από την "
                                             "πρώτη στιγμή υποψίες ότι έπεσε θύμα εγκληματικής ενέργειας.Χάρη στον "
                                             "συγκεκριμένο αξιωματικό του Τ.Α Ομόνοιας οι άντρες του Τμήματος "
                                             "Ανθρωποκτονιών είχαν επικεντρωθεί στην περίπτωση της 38χρονης, "
                                             "πριν την ταυτοποίησή της.Τη σκυτάλη των ερευνών πήρε στη συνέχεια η "
                                             "ομάδα δακτυλοσκόπησης της Διεύθυνσης Εγκληματολογικών Ερευνών που "
                                             "κατάφερε να ταυτοποιήσει το πτώμα από τα δακτυλικά αποτυπώματα. "
                                             "Αστυνομικές πηγές εξηγούν ότι πρόκειται για μία δύσκολη διαδικασία που "
                                             "απαιτεί ειδικές τεχνικές, καθώς το πτώμα βρέθηκε σε προχωρημένη σήψη. Με "
                                             "τις ειδικές τεχνικές οι επιστήμονες της ΕΛ.ΑΣ. κατάφεραν την "
                                             "ταυτοποίηση μέσα σε μόλις 48 ώρες. Η έρευνα συνεχίζεται πλέον από το "
                                             "Τμήμα Ανθρωποκτονιών για τη σύλληψη του δράστη ή των δραστών. Οι "
                                             "αστυνομικοί έχουν στα χέρια τους το φάκελο από το Τ.Α. Ομόνοιας και "
                                             "αναμένεται να ανοίξουν τον κύκλο καταθέσεων.Το Χαμόγελο του Παιδιού "
                                             "είχε εκδώσει στις 24 Οκτωβρίου  2020 «Missing Alert» για την "
                                             "38χρονη  , Lin Qiu Yun, η οποία εξαφανίστηκε από το κέντρο της "
                                             "Αθήνας, κάτω από μυστηριώδεις συνθήκες.Η εξαφάνισή της δηλώθηκε λίγες "
                                             "ημέρες νωρίτερα, στις 17 Οκτωβρίου  , στο Τμήμα Ασφαλείας της "
                                             "Ομόνοιας. Η 38χρονη  Κινέζα εξαφανίστηκε από την περιοχή του "
                                             "Μεταξουργείου.Το «Χαμόγελο του Παιδιού» ενημερώθηκε για την εξαφάνιση "
                                             "της και προχώρησε στηπως διαπιστ δημοσιοποίηση των στοιχείων της 38χρονης  , "
                                             "κατόπιν αιτήματος των συγγενών της. Η ανάρτηση ανέφερε μάλιστα τότε ότι "
                                             "μπορεί να συντρέχουν λόγοι, οποίοι θέτουν τη ζωή της σε κίνδυνο. Η Lin "
                                             "Qiu Yun είχε ύψος 1.55μ., κανονικό βάρος, καστανά μαλλιά και μαύρα "
                                             "μάτια. Την ημέρα που εξαφανίστηκε φορούσε μαύρα παπούτσια, "
                                             "τζιν παντελόνι, μαύρο μπουφάν και καφέ τσάντα. Παρά τις έρευνες, "
                                             "ωστόσο, η άτυχη γυναίκα δεν είχε εντοπιστεί τον Οκτώβριο.  "
                                             "Όπως διαπιστώθηκε την παραμονή της Πρωτοχρονιάς  , "
                                             "τα δακτυλικά της αποτυπώματα ταυτοποιούνται μετά του πτώματος που "
                                             "βρέθηκε μέσα σε βαλίτσα στα Βίλια. Φαίνεται ότι κάποιος ή κάποιοι "
                                             "δολοφόνησαν την άτυχη γυναίκα σε χρόνο που δεν προσδιορίζεται. Οι "
                                             "αστυνομικοί δεν αποκλείουν η δολοφονία  να έγινε αρκετό καιρό μετά "
                                             "την εξαφάνιση της 38χρονης  γυναίκας. Το ερώτημα είναι μέχρι τότε "
                                             "που κρατούσαν οι δράστες την υπήκοο Κίνας και για ποιο λόγο τη "
                                             "δολοφόνησαν.Οι αστυνομικοί θα πάρουν κατάθεση από τον άνθρωπο που είχε "
                                             "δηλώσει την εξαφάνιση της 38χρονης  , ενώ θα κάνουν έρευνα στο "
                                             "σπίτι όπου ζούσε στο κέντρο της Αθήνας.Το θύμα πιθανότατα δολοφονήθηκε "
                                             " διά ασφυξίας. Ο δράστης δηλαδή της έκλεισε με τη βία τις "
                                             "αναπνευστικές οδούς, μέχρι που η άτυχη γυναίκα άφησε την τελευταία της "
                                             "πνοή.Σύμφωνα με την πιθανότερη εκδοχή, ακολούθως οι δράστες έβαλαν "
                                             "αμέσως το πτώμα σε βαλίτσα, το οποίο εγκατέλειψαν ΠΡΑΞΗ σε δύσβατη "
                                             "περιοχή στα Βίλια. Η βαλίτσα έμεινε στο σημείο, σύμφωνα με την "
                                             "εκτίμηση, από πέντε έως 30 ημέρες. Ο ιατροδικαστής δεν εντόπισε "
                                             "κακώσεις, ενώ το πτώμα ήταν σε προχωρημένη σήψη με αποτέλεσμα να μη "
                                             "μπορεί να προσδιοριστεί η αιτία θανάτου.Από τις τοξικολογικές εξετάσεις "
                                             "αναμένεται να διαπιστωθεί εάν η κοπέλα είχε πάρει οποιαδήποτε ουσία ή "
                                             "και εάν της είχαν χορηγηθεί βίαια.Από την πρώτη στιγμή, οι αξιωματικοί "
                                             "του ανθρωποκτονιών είχαν επικεντρώσει την έρευνά τους σε γυναίκες "
                                             "ηλικίας 30  έως 40 ετών, που είχε δηλωθεί η εξαφάνισή τους και "
                                             "αναζητούνταν από τους οικείους τους.")

# test both
# verbs_dictionary = important_verb_dict_trankit('δολοφονια')  # too slow
verbs_dictionary = important_verb_dict_spacy('δολοφονια')

# all the verbs in the article
article_verbs = []
for v in verb:
    article_verbs.append({
        'raw': v,
        'analyzed': get_specific_analyzed(v)[0][0]
    })

# all the verbs in dictionary from elastic
elastic_dict_verbs = []
for v in verbs_dictionary:
    elastic_dict_verbs.append({
        'raw': v,
        'analyzed': get_specific_analyzed(v)[0][0]
    })

# all the matching from the above two
matched_verbs = [[v2['raw'] for v1 in elastic_dict_verbs for v2 in article_verbs if v1['analyzed'] == v2['analyzed']]]
print("Matched verbs:", set(matched_verbs[0]))

# break article to sentences and find object and subject only where matched verb is located
tokens = nltk.sent_tokenize("Η ομάδα δακτυλοσκόπησης της Διεύθυνσης Εγκληματολογικών Ερευνών της "
                            "Αστυνομίας και ο διοικητής του Τμήματος Ασφαλείας Ομόνοιας ήταν οι "
                            "πρωταγωνιστές στη διαδικασία ταυτοποίησης της 38χρονης Κινέζας, "
                            "η οποία βρέθηκε δολοφονημένη μέσα σε βαλίτσα στα Βίλια. Ο διοικητής του "
                            "Τμήματος Ασφαλείας της Ομόνοιας ήταν ο άνθρωπος που από την πρώτη "
                            "στιγμή που βρέθηκε η βαλίτσα στα Βίλια κατάλαβε ότι το θύμα είναι η "
                            "εξαφανισμένη Κινέζα. Αμέσως ενημέρωσε το Τμήμα Ανθρωποκτονιών της "
                            "ΕΛ.ΑΣ. για το «ένστικτό» του. Ο αξιωματικός αυτός είχε ασχοληθεί με την "
                            "εξαφάνιση της 38χρονης  από τις 17 Οκτωβρίου  2020, "
                            "όταν δύο ομοεθνείς της είχαν δηλώσει την εξαφάνιση στο Τ.Α. Ομόνοιας. "
                            "Τα χαρακτηριστικά του πτώματος στα Βίλια ταίριαζαν στις περιγραφές που "
                            "είχαν δοθεί για την 38χρονη  , για την οποία υπήρχαν από την "
                            "πρώτη στιγμή υποψίες ότι έπεσε θύμα εγκληματικής ενέργειας.Χάρη στον "
                            "συγκεκριμένο αξιωματικό του Τ.Α Ομόνοιας οι άντρες του Τμήματος "
                            "Ανθρωποκτονιών είχαν επικεντρωθεί στην περίπτωση της 38χρονης, "
                            "πριν την ταυτοποίησή της. Τη σκυτάλη των ερευνών πήρε στη συνέχεια η "
                            "ομάδα δακτυλοσκόπησης της Διεύθυνσης Εγκληματολογικών Ερευνών που "
                            "κατάφερε να ταυτοποιήσει το πτώμα από τα δακτυλικά αποτυπώματα. "
                            "Αστυνομικές πηγές εξηγούν ότι πρόκειται για μία δύσκολη διαδικασία που "
                            "απαιτεί ειδικές τεχνικές, καθώς το πτώμα βρέθηκε σε προχωρημένη σήψη. Με "
                            "τις ειδικές τεχνικές οι επιστήμονες της ΕΛ.ΑΣ. κατάφεραν την "
                            "ταυτοποίηση μέσα σε μόλις 48 ώρες. Η έρευνα συνεχίζεται πλέον από το "
                            "Τμήμα Ανθρωποκτονιών για τη σύλληψη του δράστη ή των δραστών. Οι "
                            "αστυνομικοί έχουν στα χέρια τους το φάκελο από το Τ.Α. Ομόνοιας και "
                            "αναμένεται να ανοίξουν τον κύκλο καταθέσεων.Το Χαμόγελο του Παιδιού "
                            "είχε εκδώσει στις 24 Οκτωβρίου  2020 «Missing Alert» για την "
                            "38χρονη  , Lin Qiu Yun, η οποία εξαφανίστηκε από το κέντρο της "
                            "Αθήνας, κάτω από μυστηριώδεις συνθήκες. Η εξαφάνισή της δηλώθηκε λίγες "
                            "ημέρες νωρίτερα, στις 17 Οκτωβρίου  , στο Τμήμα Ασφαλείας της "
                            "Ομόνοιας. Η 38χρονη  Κινέζα εξαφανίστηκε από την περιοχή του "
                            "Μεταξουργείου.Το «Χαμόγελο του Παιδιού» ενημερώθηκε για την εξαφάνιση "
                            "της και προχώρησε στη δημοσιοποίηση των στοιχείων της 38χρονης  , "
                            "κατόπιν αιτήματος των συγγενών της. Η ανάρτηση ανέφερε μάλιστα τότε ότι "
                            "μπορεί να συντρέχουν λόγοι, οποίοι θέτουν τη ζωή της σε κίνδυνο. Η Lin "
                            "Qiu Yun είχε ύψος 1.55μ., κανονικό βάρος, καστανά μαλλιά και μαύρα "
                            "μάτια. Την ημέρα που εξαφανίστηκε φορούσε μαύρα παπούτσια, "
                            "τζιν παντελόνι, μαύρο μπουφάν και καφέ τσάντα. Παρά τις έρευνες, "
                            "ωστόσο, η άτυχη γυναίκα δεν είχε εντοπιστεί τον Οκτώβριο.  "
                            "Όπως διαπιστώθηκε την παραμονή της Πρωτοχρονιάς  , "
                            "τα δακτυλικά της αποτυπώματα ταυτοποιούνται μετά του πτώματος που "
                            "βρέθηκε μέσα σε βαλίτσα στα Βίλια. Φαίνεται ότι κάποιος ή κάποιοι "
                            "δολοφόνησαν την άτυχη γυναίκα σε χρόνο που δεν προσδιορίζεται. Οι "
                            "αστυνομικοί δεν αποκλείουν η δολοφονία  να έγινε αρκετό καιρό μετά "
                            "την εξαφάνιση της 38χρονης  γυναίκας. Το ερώτημα είναι μέχρι τότε "
                            "που κρατούσαν οι δράστες την υπήκοο Κίνας και για ποιο λόγο τη "
                            "δολοφόνησαν. Οι αστυνομικοί θα πάρουν κατάθεση από τον άνθρωπο που είχε "
                            "δηλώσει την εξαφάνιση της 38χρονης  , ενώ θα κάνουν έρευνα στο "
                            "σπίτι όπου ζούσε στο κέντρο της Αθήνας. Το θύμα πιθανότατα δολοφονήθηκε "
                            " διά ασφυξίας. Ο δράστης δηλαδή της έκλεισε με τη βία τις "
                            "αναπνευστικές οδούς, μέχρι που η άτυχη γυναίκα άφησε την τελευταία της "
                            "πνοή. Σύμφωνα με την πιθανότερη εκδοχή, ακολούθως οι δράστες έβαλαν "
                            "αμέσως το πτώμα σε βαλίτσα, το οποίο εγκατέλειψαν σε δύσβατη "
                            "περιοχή στα Βίλια. Η βαλίτσα έμεινε στο σημείο, σύμφωνα με την "
                            "εκτίμηση, από πέντε έως 30 ημέρες. Ο ιατροδικαστής δεν εντόπισε "
                            "κακώσεις, ενώ το πτώμα ήταν σε προχωρημένη σήψη με αποτέλεσμα να μη "
                            "μπορεί να προσδιοριστεί η αιτία θανάτου. Από τις τοξικολογικές εξετάσεις "
                            "αναμένεται να διαπιστωθεί εάν η κοπέλα είχε πάρει οποιαδήποτε ουσία ή "
                            "και εάν της είχαν χορηγηθεί βίαια. Από την πρώτη στιγμή, οι αξιωματικοί "
                            "του ανθρωποκτονιών είχαν επικεντρώσει την έρευνά τους σε γυναίκες "
                            "ηλικίας 30  έως 40 ετών, που είχε δηλωθεί η εξαφάνισή τους και "
                            "αναζητούνταν από τους οικείους τους.")
for verb in set(matched_verbs[0]):
    for t in tokens:
        if verb in t:
            print("Article sentence:", t, "___", "verb matched:", verb)
